Revit 2027 API
Zone.Spaces Property
Note: This API is now obsolete.
Get the Spaces of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the GenericZone object instead.")]
public SpaceSet Spaces { get; }
<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the GenericZone object instead.")>
Public ReadOnly Property Spaces As SpaceSet
	Get
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the GenericZone object instead.")]
property SpaceSet^ Spaces {
	SpaceSet^ get ();
}
[<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the GenericZone object instead.")>]
member Spaces : SpaceSet with get
Property Value
SpaceSet
Remarks
This property is used to get the Spaces of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace